Revit 2024 API
StructuralSectionLAngle.BoltSpacing1LongerFlange Property
 Standard bolt spacing first row in the longer flange, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double BoltSpacing1LongerFlange { get; set; }
Visual Basic
Public Property BoltSpacing1LongerFlange As Double
	Get
	Set
Visual C++
public:
property double BoltSpacing1LongerFlange {
	double get ();
	void set (double value);
}
See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace